using System;
using System.Collections.Generic;
using System.Linq;

//Профессия C#-разработчик Язык C# Модуль 14. Основы LINQ.Часть 1
namespace LINQ_PART1
{    class Program
    {
        static void Main(string[] args)
        {
            /* 14.2. Проекция и выборка - Переменные в запросах, let

            Довольно часто бывает, что при формировании запросов LINQ нам необходимо выполнять промежуточные вычисления. Для этого 
            LINQ поддерживает объявление промежуточных переменных по ключевому слову let.

            Возьмем список студентов из примера выше и добавим им всем в анкету фамилию: 


            */
        }
    }
}
